[Killed] BlockStatement
main/components/Users/UsersTable.js:29:82
     // Stryker disable next-line all : TODO try to make a good test for thi
 
     const toggleAdminCallback = async(cell) => { 
-        if (window.confirm("Are you sure you want to toggle admin privileges?")) {
-            await toggleAdminMutation.mutate(cell);
-        } else {
+        if (window.confirm("Are you sure you want to toggle admin privileges?")) {} else {
             window.alert("Cancelled procedure!");
         }
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:29:13
     // Stryker disable next-line all : TODO try to make a good test for thi
 
     const toggleAdminCallback = async(cell) => { 
-        if (window.confirm("Are you sure you want to toggle admin privileges?")) {
+        if (false) {
             await toggleAdminMutation.mutate(cell);
         } else {
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Survived] BlockStatement
main/components/Users/UsersTable.js:31:16
     const toggleAdminCallback = async(cell) => { 
         if (window.confirm("Are you sure you want to toggle admin privileges?")) {
             await toggleAdminMutation.mutate(cell);
-        } else {
-            window.alert("Cancelled procedure!");
-        }
+        } else {}
     }
 

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:57:13
 
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleInstructorCallback = async(cell) => { 
-        if (window.confirm("Are you sure you want to toggle instructor privileges?")) {
+        if (false) {
             await toggleInstructorMutation.mutate(cell);
         } else {
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/components/Users/UsersTable.js:57:87
 
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleInstructorCallback = async(cell) => { 
-        if (window.confirm("Are you sure you want to toggle instructor privileges?")) {
-            await toggleInstructorMutation.mutate(cell);
-        } else {
+        if (window.confirm("Are you sure you want to toggle instructor privileges?")) {} else {
             window.alert("Cancelled procedure!");
         }
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Survived] BlockStatement
main/components/Users/UsersTable.js:59:16
     const toggleInstructorCallback = async(cell) => { 
         if (window.confirm("Are you sure you want to toggle instructor privileges?")) {
             await toggleInstructorMutation.mutate(cell);
-        } else {
-            window.alert("Cancelled procedure!");
-        }
+        } else {}
         
     }

[Survived] StringLiteral
main/components/Users/UsersTable.js:60:26
         if (window.confirm("Are you sure you want to toggle instructor privileges?")) {
             await toggleInstructorMutation.mutate(cell);
         } else {
-            window.alert("Cancelled procedure!");
+            window.alert("");
         }
         
