[Killed] StringLiteral
main/components/Courses/AddCourseStaffForm.js:5:76
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom'
 
-function AddCourseStaffForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function AddCourseStaffForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: AddCourseStaffForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/AddCourseStaffForm.js:25:18
 
 
             <Row>
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="AddCourseStaffForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="AddCourseStaffForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
             </Row>
 
killedBy: AddCourseStaffForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Courses/AddCourseStaffForm.js:25:18
 
 
             <Row>
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="AddCourseStaffForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
             </Row>
 
killedBy: AddCourseStaffForm tests renders correctly when passing in a course staff
statusReason: Error: Unable to find an element by: [data-testid="/AddCourseStaffForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Courses/AddCourseStaffForm.js:51:66
                             id="courseId"
                             type="text"
                             isInvalid={Boolean(errors.courseId)}
-                            {...register("courseId", { required: true })}
+                            {...register("courseId", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: AddCourseStaffForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /courseId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/AddCourseStaffForm.js:54:30
                             {...register("courseId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.courseId && 'courseId is required.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: AddCourseStaffForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /courseId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/AddCourseStaffForm.js:54:30
                             {...register("courseId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.courseId && 'courseId is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: AddCourseStaffForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /courseId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Courses/AddCourseStaffForm.js:66:66
                             id="githubId"
                             type="text"
                             isInvalid={Boolean(errors.githubId)}
-                            {...register("githubId", { required: true })}
+                            {...register("githubId", { required: false })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: AddCourseStaffForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /githubId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Courses/AddCourseStaffForm.js:66:54
                             id="githubId"
                             type="text"
                             isInvalid={Boolean(errors.githubId)}
-                            {...register("githubId", { required: true })}
+                            {...register("githubId", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: AddCourseStaffForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /githubId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/AddCourseStaffForm.js:69:30
                             {...register("githubId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.githubId && 'githubId is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: AddCourseStaffForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /githubId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Courses/AddCourseStaffForm.js:69:30
                             {...register("githubId", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.githubId && 'githubId is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: AddCourseStaffForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /githubId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
