[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:29:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="CoursesForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {false}
 
                 <Col>
killedBy: CoursesEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CoursesForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/components/Courses/CoursesForm.js:74:30
                             {...register("school", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.school && 'School is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /School is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:89:30
                             {...register("term", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.term && 'Term is required. '}
+                            {errors.term || 'Term is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:104:42
                             id="startDate"
                             type="datetime-local"
                             isInvalid={Boolean(errors.startDate)}
-                            {...register("startDate", { required: true, pattern: isodate_regex })}
+                            {...register("", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:119:42
                             id="endDate"
                             type="datetime-local"
                             isInvalid={Boolean(errors.endDate)}
-                            {...register("endDate", {required: true, pattern: isodate_regex })}
+                            {...register("", {required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] LogicalOperator
main/components/Courses/CoursesForm.js:122:30
                             {...register("endDate", {required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.endDate && 'EndDate date is required. '}
+                            {errors.endDate || 'EndDate date is required. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: CoursesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
