[Killed] ConditionalExpression
src/main/pages/CourseIndexPage.js:39:13
     return (
       <BasicLayout>
         <div className="pt-2">
-          {(hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && createButton()}
+          {(true) && createButton()}
           <h1>Course</h1>
           <CoursesTable courses={courses} currentUser={currentUser} />
killedBy: CourseIndexPage tests tests buttons for editing do not show up for user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="btn btn-primary" href="/courses/create" role="button" style="float: right;" tabindex="0">Create Course</a> instead

[Killed] LogicalOperator
src/main/pages/CourseIndexPage.js:39:12
     return (
       <BasicLayout>
         <div className="pt-2">
-          {(hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR")) && createButton()}
+          {hasRole(currentUser, "ROLE_ADMIN") || hasRole(currentUser, "ROLE_INSTRUCTOR") || createButton()}
           <h1>Course</h1>
           <CoursesTable courses={courses} currentUser={currentUser} />
killedBy: CourseIndexPage tests Renders with Create Button for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Create Course/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
