[Killed] BooleanLiteral
main/components/Courses/CoursesTable.js:68:49
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
      }
 
-     if (!hasRole(currentUser, "ROLE_ADMIN") && !hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+     if (!hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_INSTRUCTOR")) {
         columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
     }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ConditionalExpression
main/components/Courses/CoursesTable.js:68:10
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "CoursesTable"));
      }
 
-     if (!hasRole(currentUser, "ROLE_ADMIN") && !hasRole(currentUser, "ROLE_INSTRUCTOR")) {
+     if (true) {
         columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
     }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="CoursesTable-cell-row-0-col-Join-button" type="button">Join</button> instead

[Killed] StringLiteral
main/components/Courses/CoursesTable.js:69:43
      }
 
      if (!hasRole(currentUser, "ROLE_ADMIN") && !hasRole(currentUser, "ROLE_INSTRUCTOR")) {
-        columns.push(ButtonColumn("Join", "primary", joinCallback, "CoursesTable"));
+        columns.push(ButtonColumn("Join", "", joinCallback, "CoursesTable"));
     }
     
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
