[Killed] BlockStatement
main/components/Users/UsersTable.js:28:96
 
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleAdminCallback = async(cell) => {
-        if (window.confirm("Are you sure you want to toggle the admin status for this user?")) {
-            toggleAdminMutation.mutate(cell);
-        }
+        if (window.confirm("Are you sure you want to toggle the admin status for this user?")) {}
     };
 
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
main/components/Users/UsersTable.js:54:101
 
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleInstructorCallback = async(cell) => {
-        if (window.confirm("Are you sure you want to toggle the instructor status for this user?")) {
-            toggleInstructorMutation.mutate(cell);
-        }
+        if (window.confirm("Are you sure you want to toggle the instructor status for this user?")) {}
     };
     
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Users/UsersTable.js:69:21
             accessor: 'githubLogin', // accessor is the "key" in the data
         },
         {
-            Header: 'fullName',
+            Header: "",
             accessor: 'fullName',
         },
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: fullName. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m
