[Killed] EqualityOperator
src/main/pages/HomePage.js:10:13
 
     const getPartOfDayGreeting = () => {
         const hour = new Date().getHours();
-        if (hour <= 12) return "Good morning";
+        if (hour < 12) return "Good morning";
         if (hour <= 18) return "Good afternoon";
         return "Good evening";
killedBy: HomePage greetings for not logged in users at different times of the day shows "Good morning, cgaucho" for not logged-in user at 12 hours
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Good morning, cgaucho/i
Received string:  "Good afternoon, cgaucho"

[Killed] EqualityOperator
src/main/pages/HomePage.js:11:13
     const getPartOfDayGreeting = () => {
         const hour = new Date().getHours();
         if (hour <= 12) return "Good morning";
-        if (hour <= 18) return "Good afternoon";
+        if (hour > 18) return "Good afternoon";
         return "Good evening";
     };
killedBy: HomePage greetings for not logged in users at different times of the day shows "Good afternoon, cgaucho" for not logged-in user at 14 hours
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Good afternoon, cgaucho/i
Received string:  "Good evening, cgaucho"

[Killed] BooleanLiteral
src/main/pages/HomePage.js:17:9
 
     const greeting = getPartOfDayGreeting();
 
-    if (!currentUser || !currentUser.loggedIn) {
+    if (currentUser || !currentUser.loggedIn) {
         return (
             <div data-testid={"HomePage-main-div"}>
killedBy: HomePage greetings for logged-in users at different times of the day shows "Good morning, pconrad" for logged-in user at 4 hours
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /Good morning, pconrad/i
Received string:  "Good morning, cgaucho"
